// pages/aboutUs/aboutUs.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
      team:'本项目由侠客IOT团队开发，团队成员均来自西华大学计算机与软件工程学院物联网工程专业。其中一人负责UI设计和前端开发，一人负责后台开发及运维，其余两人负责收集资料，书写相关的使用文档，团队成员受技术和经验所限，若该系统有任何不妥之处，欢迎随时向我们提出，不胜感激。',
      appMessage:'团队开发该小程序的初衷是为了解决广大考生填报志愿难的问题，志愿填报不是一件小事情，正所谓高考考得好只是成功了一半，志愿填得好才算真的成功，为此，团队成员也做了很多调查，也是在学院老师的帮助下开发了这款小程序，其核心算法是基于用户的协同过滤，虽然目前该系统并不算成熟，但团队成员一直在努力的去完善，力求将该系统做到最好，欢迎广大用户提供意见以帮助我们进行修正。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})